In [2]:
import pandas as pd
import seaborn as sns
import numpy as np

### Q. titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 df를 만드세요

In [24]:
dt = sns.load_dataset('titanic')
df = dt.loc[:,['age','fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

### Q. 10을 더하는 함수 add_10 과 두 객체의 합 add_two_obj 함수를 정의한 후 결과값이 각각 20과 20을 출력하세요.

In [7]:
def add_10(x): return x+10
def add_two_obj(x,y): return x+y
print(add_10(10),add_two_obj(10,10))

20 20

### Q. 10을 곱하는 사용자 함수와 두 객체의 나눗셈을 수행하는 사용자 함수를 정의한 후 결과값이 각각 200과 10을 출력하세요.

In [6]:
def mul_10(x): return x*10
def div_two_obj(x,y): return round(x/y,2)
print(mul_10(20),'\n',div_two_obj(200,20))

200
 10.0

### Q.df_age 에 add_10 함수를 적용해서 출력하세요.

In [9]:
df_age = add_10(df.age)
df_age

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [14]:
df_age = df.age.apply(add_10)
df_age

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

### Q. 시리즈 객체 + 숫자를 연산하는 방식으로 df.age에 10을 더한 후 sr2에 저장하고 출력하세요.

In [10]:
sr2 = df.age + 10
sr2

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

### Q. 람다 함수를 활용해서 위와 같은 연산을 수행하고 결과를 sr3로 출력하세요.

In [12]:
sr3 = df.age.apply(lambda x: x+10)
sr3

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

### Q. df의 'age', 'fare' 칼럼에 10을 더하는 사용자 함수를 정의하고 applymap()으로 각 사용자 함수를 매핑한 후 출력하세요.

In [82]:
def cal(x): return x + 10
df_map = df.applymap(cal)
df_map.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [30]:
# def add_10(x): return x + 10
# def sub_10(x): return x - 10
# def mul_10(x): return x * 10
# def div_10(x): return round(x / 10,2)
# print(df.applymap(add_10).head(),'\n',df.applymap(sub_10).head(),'\n',df.applymap(mul_10).head(),'\n',df.applymap(div_10).head())

8.05

### Q. df_map의 [0,0]을 NaN으로 변경한 후 missing_value 함수를 적용해서 불린 시리즈를 반환하세요.

In [84]:
df_map.iloc[0,0] = np.nan
def missing_value(x):
    return x.isnull()
df_map.apply(missing_value)

       age   fare
0     True  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

### Q. titanic 데이터셋을 seaborn에서 로딩한 후 블린 인덱싱을 이용하여 아래 사항들을 수행하세요.
- 나이가 10대(10~19세)인 승객만 따로 선택
- 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
- 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택

In [8]:
# 나이가 10대(10~19세)인 승객만 따로 선택
dt = sns.load_dataset('titanic')
dt.loc[(dt.age >= 10) & (dt.age < 20)].head()   # 승객만 선택하고 싶다면 .index 하고 저장하면 된다

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [9]:
# 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
dt.loc[(dt.sex == 'female') & (dt.age < 10)].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
43,1,2,female,3.0,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
58,1,2,female,5.0,1,2,27.7500,S,Second,child,False,NaN,Southampton,yes,False
119,0,3,female,2.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False

In [10]:
# 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택
dt.loc[(dt.age >= 60) | (dt.age < 10),['age','sex','alone']].head()

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

## Q. 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 alone 열만 선택한 후 값을 True로 변경하세요

In [95]:
dt.loc[(dt.age >= 60) | (dt.age < 10),['alone']] = True
dt.loc[(dt.age >= 60) | (dt.age < 10),['alone']]

     alone
7     True
10    True
16    True
24    True
33    True
..     ...
831   True
850   True
851   True
852   True
869   True

[88 rows x 1 columns]

### Q. 최대값 - 최소값을 반환하는 사용자 함수를 min_max로 정의하고 age, fare 열로 구성되는 타이타닉 데이터프레임df 에 적용하여 결과와 자료형을 출력하세요. source : titanic = sns.load_dataset('titanic')

In [69]:
dt = sns.load_dataset('titanic')
def min_max(x): return max(x) - min(x)
df = dt.loc[:,['age','fare']]
df.apply(min_max)

age      79.5800
fare    512.3292
dtype: float64

### Q. df 에서 'age' 칼럼과 'fare'칼럼을 더한 가격을 리턴하는 사용자 함수를 정의한 후 df['add'] 변수를 생성하여 출력하세요.(lambda 함수 사용)

In [76]:
def age_fare(x): return x + df.age + df.fare
df['add'] = 0
df['add'] = df['add'].pipe(lambda x: age_fare(x))
df

      age     fare       add
0    22.0   7.2500   29.2500
1    38.0  71.2833  109.2833
2    26.0   7.9250   33.9250
3    35.0  53.1000   88.1000
4    35.0   8.0500   43.0500
..    ...      ...       ...
886  27.0  13.0000   40.0000
887  19.0  30.0000   49.0000
888   NaN  23.4500       NaN
889  26.0  30.0000   56.0000
890  32.0   7.7500   39.7500

[891 rows x 3 columns]

In [ ]:
def add_two_obj(a,b):
    return a + b
df['add'] = df.apply(lambda x:add_two_obj(x['age'],x['fare']),axis=1)

### Q. 각 열의 NaN 찾기, 각 열의 NaN 개수 반환, 데이터프레임의 총 NaN 개수를 반환하는 사용자 함수를 정의한 후 df.pipe 메소드로 함수 매핑한 결과를 모두 출력하세요.

In [35]:
# 각 열의 NaN 찾기
def find_na(x):
    return x.isnull()
df1 = df.pipe(find_na)
df1[(df1['age'] == True)|(df1['fare'] == True)|(df1['add'] == True)].head()

     age   fare   add
5   True  False  True
17  True  False  True
19  True  False  True
26  True  False  True
28  True  False  True

In [36]:
# 각 열의 NaN 개수 반환
def col_na(x): return find_na(x).sum()
df.pipe(col_na)

age     177
fare      0
add     177
dtype: int64

In [37]:
# 데이터프레임의 총 NaN 개수를 반환
def all_na(x): return col_na(x).sum()
df.pipe(all_na)

354

### Q. 타이타닉 df의 열 순서를 아래와 같이 재구성하고 출력하세요
* 열 선택 : ['pclass', 'sex', 'age', 'survived'].
* 열 이름의 리스트 만들기
* 열 이름을 알파벳 순으로 정렬하기
* 열 이름을 기존 순서의 정반대 역순으로 정렬하기
* 열 이름을 사용자가 정의한 임의의 순서로 재배치하기

In [54]:
# 열 선택 : ['pclass', 'sex', 'age', 'survived'] , 열 이름의 리스트 만들기
df1 = dt[['pclass','sex','age','survived']]
li = list(df1.columns)
print(li)
df1.head()

['pclass', 'sex', 'age', 'survived']

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

In [52]:
# 열 이름을 알파벳 순으로 정렬하기
df2 = dt[sorted(li)]
df2.head()

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [51]:
# 열 이름을 기존 순서의 정반대 역순으로 정렬하기
df3 = dt[sorted(li,reverse=True)]
df3.head()

   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

In [56]:
# 열 이름을 사용자가 정의한 임의의 순서로 재배치하기
def df4(a,b,c,d):
    global li
    df4 = dt[[li[a],li[b],li[c],li[d]]]
    return df4
df4(2,1,0,3).head()

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0